{
    "version": "https://jsonfeed.org/version/1",
    "title": "HalfBlog",
    "description": "",
    "home_page_url": "https://mrhalflife280.github.io/HalfBlog",
    "feed_url": "https://mrhalflife280.github.io/HalfBlog/feed.json",
    "user_comment": "",
    "author": {
        "name": "MrHalfLife"
    },
    "items": [
        {
            "id": "https://mrhalflife280.github.io/HalfBlog/about-the-whole-bitview-stuff.html",
            "url": "https://mrhalflife280.github.io/HalfBlog/about-the-whole-bitview-stuff.html",
            "title": "About the whole BitView stuff",
            "summary": "Hello (this is a repost, og post here) I know this situation is like 21 days old as I am writing this (the whole stuff&hellip;",
            "content_html": "<p>Hello (this is a repost, og post <a href=\"https://blog.spacehey.com/entry?id=1440880\">here</a>)</p>\n<p>I know this situation is like 21 days old as I am writing this (the whole stuff happened at 2.2.2025)</p>\n<p>This response won't start with \"I made a severe and continuous lapse in my judgment, and I don’t expect to be forgiven. I’m simply here to apologize.\"</p>\n<p>So, yes, I got banned from BitView, I know it sucks and it sucks for me too. Well, I had this idea for a response for a while now but didn't see the time until now.</p>\n<p>Around the 2nd of February, when news broke out that ATreeager got banned from BitView, similar to what happened on the 31st of December 2024, with the whole Wizz thing. The Treeager Trashtalk server got many members basically trying to figure out what the hell was going on. I won't get too much into detail, since one of BitView mods made a blog post that you can read here:<br>https://www.bitview.net/blog#169</p>\n<p>I was also confused with all the other BitView people, the chat was going insane, and also the day before, ATreeager's server was raided by trolls and so on.</p>\n<p>Now this may seem like I just mention here for no reason in the middle of this blog, but my brain sometimes makes random sentences that could seem offensive without a second thought, but when confronted or looking back, I may say \"Who is this idiot\" or \"oh shit, here come the consequences\".</p>\n<p>I made a very <strong>BAD </strong>comment about a BitView moderator/maintainer, during a time when messages like \"Bittoco is evil\" and so were sent. I've heard someone from the Bittoco Discord Server was sending the convos from Treeager's server there, and since they posted it there, it was seen as Transphobic. I know I have responsibility for the stuff I say online or offline, and it ended up adding more fuel to the fire, since now the topic of transphobia is now in this situation about grooming and so</p>\n<p>I was banned 30 minutes later from BitView and the Bittoco Discord Server permanently.</p>\n<p>I panicked, it was also around 9 p.m. or 10 p.m. when I started to think of what I was banned for, since Carlbot just N/A, so no ban reason for me.</p>\n<p>Someone said to contact a BitView mod on Discord, which I did. I had a convo with them for 28 minutes, until they ended up saying \"Yeah I'll send it to the staff and see what they think.\"</p>\n<p>I also do want to talk about something, that the BitView mod probably noticed (and the staff if they sent it to them)</p>\n<p>The time that took for me to respond was suspiciously slow as if I was trying to make excuses to get me back to the platform, which has been used many times with bad people. I asked myself, things like \"Why did you write this\", \"What was your motive\" and other stuff, and it takes way too much time to actually get an answer if you are asking yourself. Some people may relate. But another reason why it took so slowly is because I was tired as hell and I needed to complete to talk to the BitView staff before going to bed</p>\n<p>If any BitView staff is reading this to the end, great! You have heard my side of the story, but I do have another thing: If I make a stupid comment, say something stupid, or just begin in a bad day, someone, that is either a BitView staff or so, could ask me \"Hey MrHalfLife, are you good?\" or \"Hey MrHalfLife, what did you mean with that comment?\" etc. I may say \"I am in a bad day\" or I may say the word \"Brainmesser\" which means in this context \"Yeah, I made a statement without second thoughts.\" which could be really good.<br><br>So, I'm sorry for anyone who got offended. I am just some 13 year old who just didn't think before sending a message.</p>\n<p>And that's all I have to say about that...<br><br><strong>EDIT (16.03.2025)</strong>: BitView changed their age requirement from 13 to 14+, and since I am turning 14 this year, on the 8th of December, I may come back. However I am not sure if the Bittoco people or BitView people would read this</p>",
            "author": {
                "name": "MrHalfLife"
            },
            "tags": [
            ],
            "date_published": "2025-03-26T18:31:21+01:00",
            "date_modified": "2025-03-26T18:31:35+01:00"
        },
        {
            "id": "https://mrhalflife280.github.io/HalfBlog/welcome-to-halfblog.html",
            "url": "https://mrhalflife280.github.io/HalfBlog/welcome-to-halfblog.html",
            "title": "Welcome to HalfBlog",
            "summary": "Hello, this is my new blog, for real this time, I won’t be using ATSPACE with WordPress since it needs SSL, which you have to&hellip;",
            "content_html": "<p>Hello, this is my new blog, for real this time, I won’t be using ATSPACE with WordPress since it needs SSL, which you have to pay for :(</p><p>So I decided to post the blog posts here, hosted under GitHub Pages!</p><p>End.</p>",
            "author": {
                "name": "MrHalfLife"
            },
            "tags": [
            ],
            "date_published": "2025-03-23T16:01:50+01:00",
            "date_modified": "2025-03-23T16:01:50+01:00"
        }
    ]
}
