{
    "version": "https://jsonfeed.org/version/1",
    "title": "HalfBlog",
    "description": "",
    "home_page_url": "https://mrhalflife280.github.io/HalfBlog",
    "feed_url": "https://mrhalflife280.github.io/HalfBlog/feed.json",
    "user_comment": "",
    "author": {
        "name": "MrHalfLife"
    },
    "items": [
        {
            "id": "https://mrhalflife280.github.io/HalfBlog/my-opinions-on-ai.html",
            "url": "https://mrhalflife280.github.io/HalfBlog/my-opinions-on-ai.html",
            "title": "My opinions on AI",
            "summary": "Artificial Intelligence is probably one of the most overhyped, over-exaggerated, over-feared, and overpraised technologies that has ever existed. That’s not to say it isn’t important.",
            "content_html": "<p data-pm-slice=\"1 1 []\">Artificial Intelligence is probably one of the most overhyped, over-exaggerated, over-feared, and overpraised technologies that has ever existed.</p>\n<p>That’s not to say it isn’t important. It <em>is</em> going to be a multi-billion-dollar industry—it probably already is. But I think people fundamentally misunderstand what AI actually is.</p>\n<div><hr></div>\n<h2>The Illusion of Intelligence</h2>\n<p>AI people love to boost the hype because AI carries an illusion: the illusion that it's something greater than it actually is. But here’s my contention:</p>\n<blockquote>\n<p><strong>Artificial intelligence is just a computer program.</strong></p>\n</blockquote>\n<p>It takes inputs, gives outputs, and it's trained on massive datasets. But at its core, it's doing what any other computer program does. It may be more complex, but it's not fundamentally different.</p>\n<div><hr></div>\n<h2>AI Cults and the Extremes</h2>\n<p>Some people have joined AI cults—either radically pro-AI or doom-and-gloom anti-AI.</p>\n<p>There are people who genuinely believe AI will enslave and torture humanity. Others think it will solve every problem on Earth. Both camps are wrong.</p>\n<p>The truth is more boring: AI is a tool, and like any other tool, it’s as good or bad as the way we use it.</p>\n<div><hr></div>\n<h2>The Real Danger</h2>\n<p>Is AI going to destroy us? Will it fire off all the nukes?</p>\n<p>Well, that depends on how <em>stupid</em> we are. If we design systems like nuclear arsenals without fail-safes, that’s on us—not the AI.</p>\n<p>Thankfully, most nuclear systems are air-gapped, require physical keys, and have multiple analog fail-safes. AI isn’t inherently dangerous; poor system design is.</p>\n<p>So no, AI isn’t going to press the red button unless we build a system dumb enough to let it.</p>\n<div><hr></div>\n<h2>The Seductive Illusion</h2>\n<p>AI uses human language, and that’s the problem. People see it speak in fluent sentences and assume intelligence. But what it’s actually doing is <strong>syntactic manipulation</strong>—not semantic understanding.</p>\n<p>It doesn't think. It doesn't know. It doesn’t \"want\" anything.</p>\n<p>It’s like a giant, fancy autocorrect. And yet, when it produces unexpected or “creative” outputs, people assume it's wise or even conscious. That’s the illusion—and it's dangerous.</p>\n<div><hr></div>\n<h2>Calibration Matters</h2>\n<p>A good example is the recent AI-assisted deciphering of ancient scrolls from Pompeii. AI was used to parse noisy 3D scans. But the real intelligence came from <strong>human calibration</strong>.</p>\n<p>Humans tweaked and checked the results. If AI spit out nonsense, they rejected it. If it found actual Latin words, they confirmed and built on it. AI was just a tool in that process—not the translator.</p>\n<p>This highlights a crucial point:</p>\n<blockquote>\n<p><strong>AI is only effective when it's properly calibrated.</strong></p>\n</blockquote>\n<p>You must be able to verify its answers. Otherwise, it’s just generating plausible-sounding gibberish.</p>\n<div><hr></div>\n<h2>AI’s Complexity = Its Unreliability</h2>\n<p>When a simple program fails, we can debug it. When AI fails, we often <em>can’t</em> understand why. Worse, because it looks like it’s doing something smart, we hesitate to question it.</p>\n<p>The bigger risk isn't what AI can do—it’s what people think it can do.</p>\n<p>People see the output and assume intelligence, wisdom, or even consciousness. But really, it’s just high-level symbol manipulation. It has no understanding.</p>\n<div><hr></div>\n<h2>Statistics, Academia, and Rituals</h2>\n<p>This illusion isn’t unique to AI. The same thing happens in academia, especially with statistics. People treat statistical rituals as if they carry truth just because they look scientific.</p>\n<p>Null hypothesis testing is a great example. Most people using it don't understand it. It’s a ritual that adds a veneer of authority to ideas that may be completely wrong.</p>\n<p>AI is falling into that same trap: a ritualistic process people trust more than their own judgment.</p>\n<div><hr></div>\n<h2>Mediocrity at Scale</h2>\n<p>AI isn’t just misleading; it’s making the internet worse.</p>\n<p>Search results are flooded with AI-generated slop—low-quality, uninspired, formulaic junk. It’s like spreading a teaspoon of butter over an entire loaf of bread: thin, tasteless, and unfulfilling.</p>\n<p>People submit AI-generated content as if it's profound. They assume AI knows something they don’t. But the reality is much sadder—it’s not smart, and it’s not thinking.</p>\n<div><hr></div>\n<h2>My First AI Use</h2>\n<p class=\"\" data-start=\"183\" data-end=\"344\">Recently, I used AI for the first time—<em data-start=\"222\" data-end=\"233\">seriously</em> used it. Not just asking dumb questions or making it write fanfic. I used it to help me <strong data-start=\"322\" data-end=\"343\">learn how to code</strong>.</p>\n<p class=\"\" data-start=\"346\" data-end=\"507\">I didn’t know anything about web development. I didn’t know how HTML worked. But I wanted to make a website, and AI gave me just enough direction to get started.</p>\n<p class=\"\" data-start=\"509\" data-end=\"727\">I started small. Just a basic page with some text and links. Then I learned how to style it with CSS. I figured out how to make buttons, layouts, and even forms. Now I can build <strong data-start=\"687\" data-end=\"716\">very simple HTML websites</strong> by myself.</p>\n<p class=\"\" data-start=\"729\" data-end=\"924\">That moment—realizing I had made something, coded something, <em data-start=\"790\" data-end=\"801\">published</em> something—was powerful. Not because the AI was smart, but because I finally felt like I understood how the machine worked.</p>\n<p class=\"\" data-start=\"926\" data-end=\"1044\">So no, AI didn’t do it for me. It pointed me in the right direction. But I still had to learn. I still had to <em data-start=\"1036\" data-end=\"1043\">build</em>.</p>\n<p class=\"\" data-start=\"1046\" data-end=\"1081\">And now? I know how to make things.</p>\n<div><hr></div>\n<h2>Final Thoughts</h2>\n<p>AI <em>feels</em> deep because it mimics human language, but it’s a blind machine. It has no idea what it's saying. The real danger isn’t in the tech—it's in how we <em>perceive</em> it.</p>\n<blockquote>\n<p><strong>AI is dangerous because people trust it, not because of what it is.</strong></p>\n</blockquote>\n<p>It gives us the illusion of depth, the illusion of wisdom, and people buy into that illusion. That’s what makes it powerful—and potentially harmful.</p>\n<p>And yeah, maybe it's demonic. But that's another video.</p>",
            "author": {
                "name": "MrHalfLife"
            },
            "tags": [
            ],
            "date_published": "2025-05-17T11:46:07+02:00",
            "date_modified": "2025-05-17T11:46:07+02:00"
        },
        {
            "id": "https://mrhalflife280.github.io/HalfBlog/when-losers-have-lost-their-minds-bigots.html",
            "url": "https://mrhalflife280.github.io/HalfBlog/when-losers-have-lost-their-minds-bigots.html",
            "title": "When losers have lost their minds (Bigots)",
            "summary": "As you probably know, there's a lot of transphobia, homophobia, right-wing rhetoric, and anti-feminism—especially in the United States, but also to some extent in Germany.",
            "content_html": "<p class=\"\" data-start=\"123\" data-end=\"519\">As you probably know, there's a lot of transphobia, homophobia, right-wing rhetoric, and anti-feminism—especially in the United States, but also to some extent in Germany. There's been a lot of talk about the AfD, the Trump administration, and some weird multi-billionaire who just wants to destroy U.S. aid. I like to call them <strong data-start=\"452\" data-end=\"475\">\"The Three Losers.\"</strong> Here are my opinions on these three idiots:</p>\n<h3 class=\"\" data-start=\"526\" data-end=\"533\">AfD</h3>\n<p class=\"\" data-start=\"535\" data-end=\"1043\">The AfD (<em data-start=\"544\" data-end=\"573\">Alternative für Deutschland</em>, or Alternative for Germany) is a right-wing party that was formed in 2013, and honestly, I don’t think I need to explain much further why they’re bad. They’ve been labeled as “certainly right-wing extremist” by the <em data-start=\"790\" data-end=\"823\">Bundesamt für Verfassungsschutz</em> (BfV). They've gained a lot of support in states like Saxony, and even in Thuringia, they've been elected. In the city where I live, the AfD received a lot of votes—though not enough to actually govern the state I’m in.</p>\n<h3 class=\"\" data-start=\"1050\" data-end=\"1074\">Trump Administration</h3>\n<p class=\"\" data-start=\"1076\" data-end=\"1593\">Donald Trump was elected president in 2016, and again in 2025. During his time as president of the United <em data-start=\"1182\" data-end=\"1191\">Fucking</em> States of America, he's made decisions that completely confuse me. For example, in 2025, Trump banned transgender military members from serving in the U.S. military, stating there are “only two genders,” which is completely false. Back in 2020, even Krist Novoselic—yes, <strong data-start=\"1463\" data-end=\"1486\">THE Krist Novoselic</strong>—got hate for supporting Trump. I mean, what do you expect from a former bassist being a politician?</p>\n<p class=\"\" data-start=\"1595\" data-end=\"2055\">Then there are the U.S. tech companies like Google, which reportedly removed Pride Month from Google Maps entirely, and even renamed the Gulf of Mexico to the “Gulf of America.” Out of all the issues facing the United States, <em data-start=\"1821\" data-end=\"1827\">this</em> is what they chose to focus on? I think you folks in the U.S. are probably more informed than I am, since I live in Germany and get most of my U.S. news online—so maybe I shouldn't believe everything. But still, it’s messed up.</p>\n<p class=\"\" data-start=\"2057\" data-end=\"2101\">And speaking of messed up… that leads us to:</p>\n<h3 class=\"\" data-start=\"2108\" data-end=\"2141\">Elon Musk (Multi-Billionaire)</h3>\n<p class=\"\" data-start=\"2143\" data-end=\"2449\">Before he bought Twitter and basically did a gesture resembling a Hitler salute, I thought he was a pretty cool guy. He came off as a billionaire who didn’t take himself too seriously. But after diving headfirst into MAGA culture and promoting DOGE, I’ve decided there’s nothing good left to say about him.</p>\n<p class=\"\" data-start=\"2451\" data-end=\"2924\">Not only does he seem to have an administration in the U.S. full of teenagers and unqualified hires, firing actual government employees, but he also wants to dismantle the Department of Education and eliminate U.S. Aid programs. What even goes on in his brain? Why target the Department of Education? Does he want future kids to grow up with nothing but an iPad shoved in their faces and no real education? And why cut U.S. Aid? You don’t want treatment for AIDS or cancer?</p>\n<p class=\"\" data-start=\"2926\" data-end=\"2964\">Also—<strong data-start=\"2931\" data-end=\"2964\">I WANT THE FUCKING BIRD BACK!</strong></p>\n<p class=\"\" data-start=\"2966\" data-end=\"3189\">And as for him calling one of his kids, Vivian Jenna Wilson, a victim of the “woke mind virus”—basically calling being transgender a virus—what the hell? Didn’t he literally sign the papers for her transition? Like, <em data-start=\"3182\" data-end=\"3188\">what</em>?</p>\n<p class=\"\" data-start=\"3196\" data-end=\"3224\">Yes, the world is cooked. 😭</p>",
            "author": {
                "name": "MrHalfLife"
            },
            "tags": [
            ],
            "date_published": "2025-05-15T18:22:01+02:00",
            "date_modified": "2025-05-15T18:22:01+02:00"
        },
        {
            "id": "https://mrhalflife280.github.io/HalfBlog/quick-rant-about-italian-brainrot.html",
            "url": "https://mrhalflife280.github.io/HalfBlog/quick-rant-about-italian-brainrot.html",
            "title": "Quick rant about italian brainrot",
            "summary": "[warning: rant] WHY DO VIDEOS WITH BARELY ANY EFFORT GET 100 MILLION VIEWS. IT WILL DIE IN LIKE 2 TO 3 MONTHS AND EVERYBODY WOULD&hellip;",
            "content_html": "<p>[warning: rant]</p>\n<p>WHY DO VIDEOS WITH BARELY ANY EFFORT GET 100 MILLION VIEWS. IT WILL DIE IN LIKE 2 TO 3 MONTHS AND EVERYBODY WOULD FORGET!</p>\n<p>DOES ANYONE KNOW WHAT \"Bombarido Crocodilo\" MEANS??? HERE'S THE TRANSLATION</p>\n<blockquote>\n<p>Bombarido Crocodilo, a fucking flying alligator that flies and bombs children in Gaza and Palestine, doesn't believe in Allah and loves bombs. It feeds on the spirit of your mother. And if you translated all of this, then you're an asshole. Don't break the joke. Whore.</p>\n</blockquote>\n<p>HOW CAN YOU SUPPORT STUFF, WHEN IT SAYS THAT DOESN'T BELIEVE IN ALLAH, AND BOMBING KIDS IN GAZA AND PALESTINE!</p>\n<p>This shit needs to die....</p>",
            "author": {
                "name": "MrHalfLife"
            },
            "tags": [
            ],
            "date_published": "2025-05-14T19:32:38+02:00",
            "date_modified": "2025-05-14T19:32:38+02:00"
        },
        {
            "id": "https://mrhalflife280.github.io/HalfBlog/what-were-the-halloween-documents.html",
            "url": "https://mrhalflife280.github.io/HalfBlog/what-were-the-halloween-documents.html",
            "title": "What were the &quot;Halloween Documents&quot;",
            "summary": "The Halloween documents are a series of secret Microsoft memos from the late 1990s. They came to light because they were leaked by a Microsoft&hellip;",
            "content_html": "<p>The Halloween documents are a series of secret Microsoft memos from the late 1990s. They came to light because they were leaked by a Microsoft employee and published by open source advocate Eric S. Raymond - many of them around October 31, hence the name.<br><br>The documents show: Microsoft saw Linux and open source software as a serious threat and developed strategies to slow their success - despite public statements to the contrary.</p>\n<table class=\"wikitable sortable jquery-tablesorter\">\n<thead>\n<tr>\n<th class=\"headerSort\" tabindex=\"0\" title=\"Sort ascending\" role=\"columnheader button\">No.</th>\n<th class=\"headerSort\" tabindex=\"0\" title=\"Sort ascending\" role=\"columnheader button\">Name</th>\n<th class=\"headerSort\" tabindex=\"0\" title=\"Sort ascending\" role=\"columnheader button\">Author</th>\n<th class=\"headerSort\" tabindex=\"0\" title=\"Sort ascending\" role=\"columnheader button\">Date</th>\n<th class=\"headerSort\" tabindex=\"0\" title=\"Sort ascending\" role=\"columnheader button\">Brief description</th>\n</tr>\n</thead>\n<tbody>\n<tr valign=\"top\">\n<td>I</td>\n<td>\"Open Source Software: A (New?) Development Methodology\"</td>\n<td>Microsoft / Vinod Valloppillil</td>\n<td><span data-sort-value=\"000000001998-08-01-0000\">August 1998</span></td>\n<td>A leaked internal report <sup id=\"cite_ref-document1_1-3\" class=\"reference\"></sup></td>\n</tr>\n<tr valign=\"top\">\n<td>II</td>\n<td>\"Linux OS Competitive Analysis: The Next Java VM?\"</td>\n<td>Microsoft / Vinod Valloppillil</td>\n<td><span data-sort-value=\"000000001998-08-01-0000\">August 1998</span></td>\n<td>A leaked internal report <sup id=\"cite_ref-document2_4-0\" class=\"reference\"></sup></td>\n</tr>\n<tr valign=\"top\">\n<td>III</td>\n<td>Untitled statement</td>\n<td>Microsoft / Aurelia van den Berg</td>\n<td><span data-sort-value=\"000000001998-11-01-0000\">November 1998</span></td>\n<td>Press statement from Microsoft Netherlands <sup id=\"cite_ref-document3_5-0\" class=\"reference\"></sup></td>\n</tr>\n<tr valign=\"top\">\n<td>IV</td>\n<td>\"When Software Things Were Rotten\"</td>\n<td>Eric S. Raymond</td>\n<td><span data-sort-value=\"000000001998-12-01-0000\">December 1998</span></td>\n<td>A satire piece based on Microsoft's <a href=\"https://en.wikipedia.org/w/index.php?title=Ed_Muth&amp;action=edit&amp;redlink=1\" class=\"new\" title=\"Ed Muth (page does not exist)\">Ed Muth</a> comparing open source developers to <a href=\"https://en.wikipedia.org/wiki/Robin_Hood\" title=\"Robin Hood\">Robin Hood</a>.</td>\n</tr>\n<tr valign=\"top\">\n<td>V</td>\n<td>\"The FUD Begins\"</td>\n<td>Eric S. Raymond</td>\n<td><span data-sort-value=\"000000001999-03-01-0000\">March 1999</span></td>\n<td>A response by Raymond to Ed Muth's allegations that Linux has a \"weak <a href=\"https://en.wikipedia.org/wiki/Value_proposition\" title=\"Value proposition\">value proposition</a>\".</td>\n</tr>\n<tr valign=\"top\">\n<td>VI</td>\n<td>\"The Fatal Anniversary\"</td>\n<td>Eric S. Raymond</td>\n<td><span data-sort-value=\"000000001999-10-01-0000\">October 1999</span></td>\n<td>A response by Raymond to studies authored by the <a href=\"https://en.wikipedia.org/wiki/Gartner\" title=\"Gartner\">Gartner</a> group for Microsoft.</td>\n</tr>\n<tr valign=\"top\">\n<td>VII</td>\n<td>\"Research E-Bulletin: Attitudes Towards Shared Source and Open Source Research Study\"</td>\n<td>Microsoft</td>\n<td><span data-sort-value=\"000000002002-09-01-0000\">September 2002</span></td>\n<td>A summary of the results of a Microsoft survey describing reactions to Microsoft's <a href=\"https://en.wikipedia.org/wiki/Shared_Source_Initiative\" title=\"Shared Source Initiative\">Shared Source Initiative</a>.</td>\n</tr>\n<tr valign=\"top\">\n<td>VIII</td>\n<td>\"OSS and Government\"</td>\n<td>Microsoft / Orlando Ayala</td>\n<td><span data-sort-value=\"000000002002-11-01-0000\">November 2002</span></td>\n<td>Describes Microsoft's procedures for responding to notable conversions away from Microsoft software </td>\n</tr>\n<tr valign=\"top\">\n<td>IX</td>\n<td>\"It Ain't Necessarily SCO\"</td>\n<td>Eric S. Raymond and Rob Landley</td>\n<td><span data-sort-value=\"000000002003-08-01-0000\">August 2003</span></td>\n<td>A response to the allegations made by the <a href=\"https://en.wikipedia.org/wiki/SCO_Group\" title=\"SCO Group\">SCO Group</a> in its initial filings in <i><a href=\"https://en.wikipedia.org/wiki/SCO_v._IBM\" class=\"mw-redirect\" title=\"SCO v. IBM\">SCO v. IBM</a></i>.<sup id=\"cite_ref-document9_11-0\" class=\"reference\"></sup></td>\n</tr>\n<tr valign=\"top\">\n<td>X</td>\n<td>\"Follow The Money\"</td>\n<td>Mike Anderer</td>\n<td><span data-sort-value=\"000000002004-03-01-0000\">March 2004</span></td>\n<td>An e-mail from consultant Mike Anderer to SCO's Chris Sontag revealing Microsoft's channeling of $86<span class=\"nowrap\"> </span>million (equivalent to $140<span class=\"nowrap\"> </span>million in 2024) to SCO.<sup id=\"cite_ref-document10_12-0\" class=\"reference\"></sup></td>\n</tr>\n<tr valign=\"top\">\n<td>XI</td>\n<td>\"Get The FUD\"</td>\n<td>Eric S. Raymond</td>\n<td><span data-sort-value=\"000000002004-06-01-0000\">June 2004</span></td>\n<td>A response to Microsoft's \"<a href=\"https://en.wikipedia.org/wiki/Get_the_Facts\" class=\"mw-redirect\" title=\"Get the Facts\">Get the Facts</a>\" campaign <sup id=\"cite_ref-document11_13-0\" class=\"reference\"></sup></td>\n</tr>\n</tbody>\n</table>\n<p class=\"\" data-start=\"94\" data-end=\"236\"><strong data-start=\"94\" data-end=\"116\">Documents I and II</strong><br data-start=\"116\" data-end=\"119\">These are leaked reports for Microsoft's own use, both written by Vinod Valloppillil, a program manager at Microsoft.</p>\n<p class=\"\" data-start=\"238\" data-end=\"558\">Document I provides a detailed introduction to the concepts behind open source software and its possible impact on Microsoft products and services. It outlines the strengths and weaknesses of open source software. Document II describes the basic architecture of the Linux system, and its relation to Unix and Windows NT.</p>\n<p class=\"\" data-start=\"560\" data-end=\"1025\">Document I revealed that \"FUD\" (spreading fear, uncertainty, and doubt) was a traditional Microsoft marketing strategy, acknowledged and understood internally. Examples of Microsoft's FUD tactics are announcing nonexistent products or spreading rumors that competing products will crash Windows. Raymond suggests that the documents show that while Microsoft may have been dismissive of open source software in public, it privately considers it a serious competitor.</p>\n<p class=\"\" data-start=\"1027\" data-end=\"1727\">In discussing ways of competing with open source, Document I suggests that one reason that open source projects had been able to enter the server market is the market's use of standardized protocols. The document then suggests that this can be stopped by \"extending these protocols and developing new protocols\" and \"de-commoditiz[ing] protocols &amp; applications\". This policy has been internally nicknamed \"embrace, extend, extinguish\". Document I also suggests that open source software \"is long-term credible ... FUD tactics can not be used to combat it\", and \"Recent case studies (the Internet) provide very dramatic evidence ... that commercial quality can be achieved / exceeded by OSS projects.\"</p>\n<p class=\"\" data-start=\"1729\" data-end=\"1826\">Documents I and II were filed as evidence on January 16, 2007, in the case of Comes v. Microsoft.</p>",
            "author": {
                "name": "MrHalfLife"
            },
            "tags": [
            ],
            "date_published": "2025-05-01T12:26:15+02:00",
            "date_modified": "2025-05-01T12:26:15+02:00"
        },
        {
            "id": "https://mrhalflife280.github.io/HalfBlog/the-main-problems-with-youtube-revivals.html",
            "url": "https://mrhalflife280.github.io/HalfBlog/the-main-problems-with-youtube-revivals.html",
            "title": "The main problems with YouTube Revivals",
            "summary": "Hello, So, as you know, I used to have a BitView account, and currently own a KamTape and EraCast account. My BitView account got banned,&hellip;",
            "content_html": "<p>Hello,<br><br>So, as you know, I used to have a BitView account, and currently own a KamTape and EraCast account. My BitView account got banned, if you wanna read the reason, look at the post \"About the whole BitView stuff\".<br><br>The problem is that the moderation of most of the Revivals sucks, you can find music videos on BitView from big artists like Madonna (which I reported), I like the way that EraCast handles Copyright, they have a Content-ID-like feature where if you upload copyrighted material, it will be auto-flagged.<br><br>Another problem is the UTTP, there will be these disgusting pieces of crap on these sites and so.<br><br>But the mods are really nice, and I have met multiple nice people on these revivals, like A Treeager.<br><br>And that's all I have to say about that</p>",
            "author": {
                "name": "MrHalfLife"
            },
            "tags": [
            ],
            "date_published": "2025-03-30T12:00:26+02:00",
            "date_modified": "2025-03-30T12:00:26+02:00"
        },
        {
            "id": "https://mrhalflife280.github.io/HalfBlog/about-the-whole-bitview-stuff.html",
            "url": "https://mrhalflife280.github.io/HalfBlog/about-the-whole-bitview-stuff.html",
            "title": "About the whole BitView stuff",
            "summary": "Hello (this is a repost, og post here) I know this situation is like 21 days old as I am writing this (the whole stuff&hellip;",
            "content_html": "<p>Hello (this is a repost, og post <a href=\"https://blog.spacehey.com/entry?id=1440880\">here</a>)</p>\n<p>I know this situation is like 21 days old as I am writing this (the whole stuff happened at 2.2.2025)</p>\n<p>This response won't start with \"I made a severe and continuous lapse in my judgment, and I don’t expect to be forgiven. I’m simply here to apologize.\"</p>\n<p>So, yes, I got banned from BitView, I know it sucks and it sucks for me too. Well, I had this idea for a response for a while now but didn't see the time until now.</p>\n<p>Around the 2nd of February, when news broke out that ATreeager got banned from BitView, similar to what happened on the 31st of December 2024, with the whole Wizz thing. The Treeager Trashtalk server got many members basically trying to figure out what the hell was going on. I won't get too much into detail, since one of BitView mods made a blog post that you can read here:<br>https://www.bitview.net/blog#169</p>\n<p>I was also confused with all the other BitView people, the chat was going insane, and also the day before, ATreeager's server was raided by trolls and so on.</p>\n<p>Now this may seem like I just mention here for no reason in the middle of this blog, but my brain sometimes makes random sentences that could seem offensive without a second thought, but when confronted or looking back, I may say \"Who is this idiot\" or \"oh shit, here come the consequences\".</p>\n<p>I made a very <strong>BAD </strong>comment about a BitView moderator/maintainer, during a time when messages like \"Bittoco is evil\" and so were sent. I've heard someone from the Bittoco Discord Server was sending the convos from Treeager's server there, and since they posted it there, it was seen as Transphobic. I know I have responsibility for the stuff I say online or offline, and it ended up adding more fuel to the fire, since now the topic of transphobia is now in this situation about grooming and so</p>\n<p>I was banned 30 minutes later from BitView and the Bittoco Discord Server permanently.</p>\n<p>I panicked, it was also around 9 p.m. or 10 p.m. when I started to think of what I was banned for, since Carlbot just N/A, so no ban reason for me.</p>\n<p>Someone said to contact a BitView mod on Discord, which I did. I had a convo with them for 28 minutes, until they ended up saying \"Yeah I'll send it to the staff and see what they think.\"</p>\n<p>I also do want to talk about something, that the BitView mod probably noticed (and the staff if they sent it to them)</p>\n<p>The time that took for me to respond was suspiciously slow as if I was trying to make excuses to get me back to the platform, which has been used many times with bad people. I asked myself, things like \"Why did you write this\", \"What was your motive\" and other stuff, and it takes way too much time to actually get an answer if you are asking yourself. Some people may relate. But another reason why it took so slowly is because I was tired as hell and I needed to complete to talk to the BitView staff before going to bed</p>\n<p>If any BitView staff is reading this to the end, great! You have heard my side of the story, but I do have another thing: If I make a stupid comment, say something stupid, or just begin in a bad day, someone, that is either a BitView staff or so, could ask me \"Hey MrHalfLife, are you good?\" or \"Hey MrHalfLife, what did you mean with that comment?\" etc. I may say \"I am in a bad day\" or I may say the word \"Brainmesser\" which means in this context \"Yeah, I made a statement without second thoughts.\" which could be really good.<br><br>So, I'm sorry for anyone who got offended. I am just some 13 year old who just didn't think before sending a message.</p>\n<p>And that's all I have to say about that...<br><br><strong>EDIT (16.03.2025)</strong>: BitView changed their age requirement from 13 to 14+, and since I am turning 14 this year, on the 8th of December, I may come back. However I am not sure if the Bittoco people or BitView people would read this</p>",
            "author": {
                "name": "MrHalfLife"
            },
            "tags": [
            ],
            "date_published": "2025-03-26T18:31:21+01:00",
            "date_modified": "2025-03-26T18:31:35+01:00"
        },
        {
            "id": "https://mrhalflife280.github.io/HalfBlog/welcome-to-halfblog.html",
            "url": "https://mrhalflife280.github.io/HalfBlog/welcome-to-halfblog.html",
            "title": "Welcome to HalfBlog",
            "summary": "Hello, this is my new blog, for real this time, I won’t be using ATSPACE with WordPress since it needs SSL, which you have to&hellip;",
            "content_html": "<p>Hello, this is my new blog, for real this time, I won’t be using ATSPACE with WordPress since it needs SSL, which you have to pay for :(</p><p>So I decided to post the blog posts here, hosted under GitHub Pages!</p><p>End.</p>",
            "author": {
                "name": "MrHalfLife"
            },
            "tags": [
            ],
            "date_published": "2025-03-23T16:01:50+01:00",
            "date_modified": "2025-03-23T16:01:50+01:00"
        }
    ]
}
